Duet3D/Duet3Expansion/src/atmel/SAMD10_DFP/1.1.68/atdf/ATSAMD10D14AM.atdf
        <module name="PTC" id="U2215" version="1.0.4">
          <instance name="PTC">
            <register-group name="PTC" name-in-module="PTC" address-space="base" offset="0x42002C00"/>
            <signals>
              <signal group="X" index="0" function="B_PTC" pad="PA14"/>
              <signal group="X" index="1" function="B_PTC" pad="PA15"/>
              <signal group="X" index="2" function="B_PTC" pad="PA10"/>
              <signal group="X" index="3" function="B_PTC" pad="PA11"/>
              <signal group="X" index="4" function="B_PTC" pad="PA16"/>
              <signal group="X" index="5" function="B_PTC" pad="PA17"/>
              <signal group="X" index="6" function="B_PTC" pad="PA22"/>
              <signal group="X" index="7" function="B_PTC" pad="PA23"/>
              <signal group="X" index="8" function="B_PTC" pad="PA24"/>
              <signal group="X" index="9" function="B_PTC" pad="PA25"/>
              <signal group="X" index="10" function="B_PTC" pad="PA27"/>
              <signal group="Y" index="0" function="B_PTC" pad="PA02"/>
              <signal group="Y" index="1" function="B_PTC" pad="PA03"/>
              <signal group="Y" index="2" function="B_PTC" pad="PA04"/>
              <signal group="Y" index="3" function="B_PTC" pad="PA05"/>
              <signal group="Y" index="4" function="B_PTC" pad="PA06"/>
              <signal group="Y" index="5" function="B_PTC" pad="PA07"/>
              <signal group="Y" index="6" function="B_PTCXY" pad="PA14"/>
              <signal group="Y" index="7" function="B_PTCXY" pad="PA15"/>
              <signal group="Y" index="8" function="B_PTCXY" pad="PA10"/>
              <signal group="Y" index="9" function="B_PTCXY" pad="PA11"/>
              <signal group="Y" index="10" function="B_PTCXY" pad="PA16"/>
              <signal group="Y" index="11" function="B_PTCXY" pad="PA17"/>
              <signal group="Y" index="12" function="B_PTCXY" pad="PA22"/>
              <signal group="Y" index="13" function="B_PTCXY" pad="PA23"/>
              <signal group="Y" index="14" function="B_PTCXY" pad="PA24"/>
              <signal group="Y" index="15" function="B_PTCXY" pad="PA25"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="23"/>
              <param name="INSTANCE_ID" value="75"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="U2202" version="1.0.1">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x40001400"/>
            <parameters>
              <param name="ALARM_NUM" value="1"/>
              <param name="COMP16_NUM" value="2"/>
              <param name="COMP32_NUM" value="1"/>
              <param name="GCLK_ID" value="4"/>
              <param name="NUM_OF_ALARMS" value="1"/>
              <param name="NUM_OF_COMP16" value="2"/>
              <param name="NUM_OF_COMP32" value="1"/>
              <param name="INSTANCE_ID" value="5"/>
            </parameters>
          </instance>
        </module>
        <module name="SERCOM" id="U2201" version="2.0.0">
          <instance name="SERCOM0">
            <register-group name="SERCOM0" name-in-module="SERCOM" address-space="base" offset="0x42000800"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA04"/>
              <signal group="PAD" index="0" function="C" pad="PA14"/>
              <signal group="PAD" index="0" function="C" pad="PA06"/>
              <signal group="PAD" index="1" function="D" pad="PA05"/>
              <signal group="PAD" index="1" function="C" pad="PA15"/>
              <signal group="PAD" index="1" function="C" pad="PA07"/>
              <signal group="PAD" index="2" function="D" pad="PA06"/>
              <signal group="PAD" index="2" function="D" pad="PA08"/>
              <signal group="PAD" index="2" function="C" pad="PA04"/>
              <signal group="PAD" index="2" function="C" pad="PA10"/>
              <signal group="PAD" index="3" function="D" pad="PA07"/>
              <signal group="PAD" index="3" function="D" pad="PA09"/>
              <signal group="PAD" index="3" function="C" pad="PA05"/>
              <signal group="PAD" index="3" function="C" pad="PA11"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="1"/>
              <param name="DMAC_ID_TX" value="2"/>
              <param name="GCLK_ID_CORE" value="14"/>
              <param name="GCLK_ID_SLOW" value="13"/>
              <param name="INT_MSB" value="6"/>
              <param name="INSTANCE_ID" value="66"/>
            </parameters>
          </instance>
          <instance name="SERCOM1">
            <register-group name="SERCOM1" name-in-module="SERCOM" address-space="base" offset="0x42000C00"/>
            <signals>
              <signal group="PAD" index="0" function="C" pad="PA22"/>
              <signal group="PAD" index="0" function="C" pad="PA30"/>
              <signal group="PAD" index="1" function="C" pad="PA23"/>
              <signal group="PAD" index="1" function="C" pad="PA31"/>
              <signal group="PAD" index="2" function="D" pad="PA30"/>
              <signal group="PAD" index="2" function="C" pad="PA16"/>
              <signal group="PAD" index="2" function="C" pad="PA24"/>
              <signal group="PAD" index="2" function="C" pad="PA08"/>
              <signal group="PAD" index="3" function="D" pad="PA31"/>
              <signal group="PAD" index="3" function="C" pad="PA17"/>
              <signal group="PAD" index="3" function="C" pad="PA25"/>
              <signal group="PAD" index="3" function="C" pad="PA09"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="3"/>
              <param name="DMAC_ID_TX" value="4"/>
              <param name="GCLK_ID_CORE" value="15"/>
              <param name="GCLK_ID_SLOW" value="13"/>
              <param name="INT_MSB" value="6"/>
              <param name="INSTANCE_ID" value="67"/>
            </parameters>
          </instance>
